# -*- coding: utf-8 -*-
import common_str

monitor_start = '⚡️ Мониторинг запущен'
monitor_stop = '✋️ Мониторинг останавливается'
monitor_already_started = 'ℹ️ Мониторинг уже был запущен'
monitor_stops = '❌ Мониторинг ещё останавливается, повторите попытку немного позднее'
monitor_already_stopped = 'ℹ️ Мониторинг не запущен'

select_curr = '✅ Выберите валюту для отображения'

lang_e = '❌ Этот язык уже выбран'

mining_algo = '💎 Алгоритмы майнинга: '
workers_active = '⛏ Активные воркеры: '
profit_per_day = '📈 Доход в день: '
unpaid = '💰 Невыплаченный баланс: '

forbidden = '❌ Доступ запрещён'

addr_set = '✏️ Введите адрес'
addr_ok = '🆗 Установлено'
addr_invalid = '❌ Невалидный адрес'
addr_enter_new = 'Повторите попытку' + ' /' + common_str.set_address

what_do = '💫 Выберите дальнейшее действие'

keyboard_data = 'ℹ️ Информация'
keyboard_start_monitor = '▶️ Запустить мониторинг'
keyboard_stop_monitor = '⏹ Остановить мониторинг'
keyboard_first_set_address = '🔧 Ввести адрес'
keyboard_set_address = '🔁 Изменить адрес'
keyboard_set_currency = '🔁 Изменить валюту'
keyboard_set_language = '🔁 Изменить язык'
